In [1]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass  
password = getpass.getpass()

········

In [5]:
connection_string = 'mysql+pymysql://root:' + password + '@localhost/sakila'
engine = create_engine(connection_string)

In [12]:
query = '''
        select customer_id, count(rental_id) as total_rents_may from sakila.rentals_may
        group by customer_id
        order by count(rental_id) desc;
        '''

data_may = pd.read_sql_query(query, engine)
data_may.head()

   customer_id  total_rents_may
0          197                8
1          506                7
2          109                7
3          269                6
4          239                6

In [11]:
query = '''
        select customer_id, count(rental_id) as total_rents_june from sakila.rentals_june
        group by customer_id
        order by count(rental_id) desc;
        '''

data_june = pd.read_sql_query(query, engine)
data_june.head()

   customer_id  total_rents_june
0           31                11
1          454                10
2          329                 9
3          295                 9
4          561                 9

In [26]:
data_may_june = data_may.merge(data_june, how="outer", on="customer_id")

In [27]:
data_may_june

     customer_id  total_rents_may  total_rents_june
0            197              8.0               8.0
1            506              7.0               5.0
2            109              7.0               5.0
3            269              6.0               3.0
4            239              6.0               5.0
..           ...              ...               ...
593           63              NaN               1.0
594          598              NaN               1.0
595          487              NaN               1.0
596          555              NaN               1.0
597          335              NaN               1.0

[598 rows x 3 columns]

In [34]:
data_may_june[data_may_june["customer_id"] == 31]

     customer_id  total_rents_may  total_rents_june
520           31              0.0              11.0

In [33]:
data_may_june['total_rents_may'] = data_may_june['total_rents_may'].fillna(0)

In [35]:
data_may_june['total_rents_june'] = data_may_june['total_rents_june'].fillna(0)

In [46]:
def customer_rentals(customer_id):
    rentals_may = data_may_june[data_may_june["customer_id"] == customer_id].total_rents_may
    rentals_june = data_may_june[data_may_june["customer_id"] == customer_id].total_rents_june
    
    if rentals_may.iloc[0] > rentals_june.iloc[0]:
        print("This client rented more movies in May")
    else: 
        print("This client rented more movies in June")

In [47]:
customer_rentals(31)

This client rented more movies in June